<?php

return [
    /*
    |--------------------------------------------------------------------------
    | SePay Configuration
    |--------------------------------------------------------------------------
    |
    | Các cấu hình cho cổng thanh toán SePay
    |
    */
    'webhook_token' => env('SEPAY_WEBHOOK_TOKEN'),
    
    /*
    |--------------------------------------------------------------------------
    | SePay API Key
    |--------------------------------------------------------------------------
    |
    | API key để truy cập vào các API của SePay
    |
    */
    'sepay_api_key' => env('SEPAY_API_KEY'),
    
    /*
    |--------------------------------------------------------------------------
    | SePay Match Pattern
    |--------------------------------------------------------------------------
    |
    | Mẫu nội dung chuyển khoản cho SePay
    |
    */
    'pattern' => env('SEPAY_MATCH_PATTERN', 'SE'),
]; 